<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v2.5.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Headlamp. Use ARCH to specify architecture: arm64 (Apple Silicon) or x64 (Intel).</string>
	<key>Identifier</key>
	<string>com.github.1ardotno.download.Headlamp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Headlamp</string>
		<!-- VALID ARCH VALUES: arm64 (Apple Silicon), x64 (Intel) -->
		<key>ARCH</key>
		<string>arm64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>2.3</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>asset_regex</key>
				<string>Headlamp-.*-mac-%ARCH%\.dmg$</string>
				<key>github_repo</key>
				<string>kubernetes-sigs/headlamp</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%-%ARCH%.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
